{"Why VCU?":"About VCU\nQuick facts\nCampus life\nStudent life\nFor parents\nAbout Richmond\nFor information on requirements (including individual school requirements), acceptance notifications, campus tours and more.\nAdmissions","What are your admission requirements for freshmen?":"Prospective freshmen seeking admission to VCU immediately after high school graduation are generally but not solely evaluated on the four criteria listed below.\nHigh school grade-point average\nTest scores from the SAT Reasoning Test or ACT; students who wish to be considered for test score optional review should review the \"Test scores\" section of our freshman admissions requirements.\nRank in class (Students graduating from a high school that does not do a class ranking will not be penalized in the admission process.)\nHigh school curriculum\nThe recommended curriculum includes:\n4 units of English\n3 units of history, social studies or government\n3 units in mathematics (including algebra I and either geometry or algebra II)\n3 units in science (at least one laboratory)\n3 units of one foreign language or 2 units of two foreign languages\nBack to top\nWhat are your admission requirements for transfer students?","What are your admission requirements for transfer students?":"Transfer applicants must present evidence of good standing at the last institution attended. A cumulative grade-point average of 2.5 on a 4.0 scale in all hours attempted is recommended for admission. Students who have earned fewer than 30 semester (45 quarter) hours must submit their high school transcripts and, if under 22 years of age, SAT/ACT scores.\nBack to top\nDoes the School of the Arts require additional admission materials?","Does the School of the Arts require additional admission materials?":"Students applying to the School of the Arts must submit the standard university undergraduate application in addition to supplemental materials. There is a $65 application fee for all School of the Arts applicants. For more information about program requirements and deadlines, contact the School of the Arts toll free at (866) 534-3201 or locally at (804) 828-2787, or visit their website.\nBack to top\nDoes the School of Engineering require additional admission materials?","Does the School of Engineering require additional admission materials?":"To be competitive for admission to the School of Engineering, freshman applicants should present a strong GPA (A/B+ average preferred), competitive test scores and a challenging college preparatory curriculum. Freshman applicants to the School of Engineering who are not accepted directly into the school will automatically be considered for admission into the undeclared major in the College of Humanities and Sciences. For additional information, call the School of Engineering at (804) 828-2129, email askengineering@vcu.edu or visit the School of Engineering website at www.egr.vcu.edu.\nBack to top\nDoes the School of Nursing require additional admission materials?","Does the School of Nursing require additional admission materials?":"Transfer applicants\nTransfer applicants to the School of Nursing must apply by the Feb. 1 deadline and must submit supplemental admissions materials, which are only available online. Along with the application for undergraduate admission, all transfer applicants to the School of Nursing, regardless of age, are required to submit SAT, ACT or GRE test scores and official transcripts from high school and all colleges and universities. In addition, applicants must submit a one- to two-page essay on the topic “Education and Life: A Personal Statement” in which they discuss their educational goals including why they wish to study their chosen major.\nBack to top\nWhat are your admission deadlines? When should I submit my application?","What are your admission deadlines? When should I submit my application?":"Freshman applicants\nFreshmen applying for guaranteed admission to the \nSchool of Medicine (B.S./M.D.)\nFreshmen applying for guaranteed admission to programs other than medicine\nFreshmen applying for scholarship consideration\nFreshmen applying for regular decision\nTransfer applicants – Monroe Park Campus undergraduate programs\nTransfer students applying for scholarship consideration\nTransfer students applying for admission to all undergraduate programs other than those in the School of the Arts\nTransfer students applying for admission to undergraduate programs in the School of the Arts should visit the school’s website at vcu.edu/arts/apply for more information about requirements and deadlines\nTransfer applicants – MCV Campus undergraduate programs\nClinical laboratory sciences\nClinical radiation sciences\nDental hygiene\nTransfer students applying for admission to undergraduate programs in the School of Nursing should visit the School of Nursing admissions website about program requirements and deadlines.\nSchool of Nursing admissions website\n* Firm deadline, separate guaranteed admission application also required.\n** Firm deadline, separate supplemental application and materials also required.\n*** Firm deadline, program begins in summer: separate supplemental application materials also required.\nBack to top\nWhen will I be notified about my acceptance?","When will I be notified about my acceptance?":"Applicants who submit completed materials by Jan. 15 will be notified by April 1. Those applying after Jan. 15 will be notified on a rolling basis until the class is filled.\nBack to top\nDo advanced placement courses help my application?","Do advanced placement courses help my application?":"Yes, AP courses give the admissions staff a better indication of how a student will do at the university because AP courses are equivalent to college courses. Honors-level and AP courses successfully completed could bring a more favorable admissions decision. The university accepts all AP classes (except Studio Art). You must have a score of 3 or better on your AP final exam to receive college credit at VCU.\nBack to top\nShould I come to campus for an interview?","Should I come to campus for an interview?":"Interviews at VCU are not required as part of the application process, but we strongly suggest that students visit campus. We hope our urban university with its academic and cultural diversity is the right setting for you. The only way to determine this is by visiting. A campus visit will enable you to see the physical layout of VCU and give you a chance to talk with currently enrolled students and faculty.\nBack to top\nWhat do I need to do if I want to come for a campus visit?","What do I need to do if I want to come for a campus visit?":"The Office of Admissions holds information sessions Monday through Friday at 10:30 a.m. and 2 p.m. and on Saturdays at 10:30 a.m. except on holidays and holiday weekends. The sessions are held in the Welcome Center at 1111 W. Broad St., which is adjacent to the Barnes & Noble @ VCU, and are followed by an hourlong walking tour of the Monroe Park Campus. After the tour is completed, for those who are interested in asking more personal questions, admissions counselors are available to meet with prospective students and their families individually. Register to attend one of our daily information sessions for prospective students and their families.\nBack to top\nVirginia Commonwealth University\nDivision of Strategic Enrollment Management\nOffice of Admissions\nUndergraduate Admissions\n821 West Franklin Street\nRichmond, Virginia 23284-2526\nPhone: (804) 828-1222 or (800) 841-3638\nFax: (804) 828-1899\nEmail: ugrad@vcu.edu\nUpdated: 05/24/2017\nCreated by VCU University Relations"}